[
    {
      "name": "chocolate_babka",
      "category": "desserts",
      "servings": "1",
      "prep": "30 min",
      "cooking": "45 min",
      "description": "This vegan version of the classic New York pastry tastes just as good as it looks and despite its looks, is actually very simple to make. Filled with swirls of chocolate in a buttery brioche-like bread, this vegan chocolate babka will have you weak at your knees, your tastebuds dancing right off your tongue, and don’t even get us started on the smell it has as it bakes in the oven.",
      "ingredients": [
        "Dry ingredients:",
        "3/4 cups soy milk",
        "2 tsp instant dry yeast",
        "1/4 cups coconut sugar",
        "2 cups flour",
        "1/2 tsp salt",
        "1/3 cups coconut oil, softened",
        "2 tbs vegan butter, softened",
        "Wet ingredients:",
        "1/2 cups coconut sugar",
        "1.5 tbs cacao",
        "1 tsp ground cinnamon",
        "1/4 tsp salt",
        "2 tbs coconut oil, softened",
        "2 tbs vegan butter, softened",
        "1/3 cups chocolate chips",
        "Glazing ingredients:",
        "1 tbs coconut sugar",
        "1.5 tbs water"
      ],
      "instructions": [
        "Make the dough. In a jug, warm the soy milk to 37°C-45°C, which is the perfect temperature to activate yeast in. Add the yeast and 1 teaspoon of the coconut sugar. Leave to activate for 10 minutes. You will know it's ready when the mix forms a layer of foam on the top. If it doesn't, check to see if your yeast is past its used by date or wait a little longer.",
        "In the mixing bowl of a stand mixer, add the rest of the coconut sugar, flour and salt. Using your fingertips, rub in the softened coconut oil and vegan butter. On a low speed with the dough hook attached, begin mixing the dry ingredients. Slowly add the wet ingredients. Knead for 8-10 minutes, until it bounces back when lightly touched. You can knead by hand if you don't own a stand mixer.",
        "Transfer the dough to a greased bowl, cover with a tea towel and place in a warm area to prove for 40-60 minutes or until doubled in size. Here's what I do. Preheat my oven to 40°C, turn it off and place the bowl in there with the oven door closed.",
        "Meanwhile make the filling. In a small bowl, stir all the ingredients together except for the chocolate chips. Place to one side.",
        "Assemble loaf. Line and lightly grease a bread tin. After the dough has doubled in size, place on a lightly floured surface and knead a few times to knock back the air. Roll out to an even 30x40cm rectangle. I used my ruler for this. Spread the filling over the top, leaving a 1.5cm gap all around the sides. Sprinkle over the chocolate chips.",
        "Tightly roll the dough to form a 40cm long log. Cut 1.5cm off both ends. Gently cut the log in half lengthways and have the cut sides facing up. Begin to twirl together. Pinch and twirl the bottom end together to keep the dough in place. Lift one side over the over, to form a twist. Always keeping the cut sides facing up. Carefully transfer the bread into the greased bread tin. Mine was long enough to form an 'S' in the tin, tucking the edges into the openings. During the second proving and baking, all the small gaps will be filled. Cover with with a tea towel and place in a warm area for another 60-90 minutes to double in size.",
        "Preheat the oven to 160°C fan forced. Bake babka for 40-45 minutes, until golden in appearance. Remove from oven, brush with sugar syrup and leave to cool in the tin for 10 minutes before removing and serving warm.",
        "To make sugar syrup, combine the coconut sugar and water in a small saucepan . Leave to boil over a medium high heat. Once the sugar dissolves remove from heat."
      ],
      "image": "assets/images/chocolate_babka.jpg",
      "image_thumbnail": "assets/images/chocolate_babka_thumbnail.jpg",
      "credit": "https://www.onegreenplanet.org/vegan-recipe/chocolatey-babka/",
      "created_at": "1570448934440"
    },
    {
      "name": "banana_pancakes",
      "category": "breakfasts",
      "servings": "12",
      "prep": "10 min",
      "cooking": "24 min",
      "description": "Forget “one bowl” – this pancake recipe takes zero bowls! The batter mixes entirely in your blender. Pour it right out of the pitcher onto your griddle! These hearty banana pancakes make for a breakfast that feels comforting and decadent, but is really far from it.",
      "ingredients": [
        "1 tbs white vinegar",
        "3/4 cups unsweetened almond milk",
        "2 cups rolled oats",
        "1 medium ripe banana(s)",
        "2 tsp baking powder",
        "1/2 tsp baking soda",
        "1/2 tsp ground cinnamon",
        "1/2 tsp salt",
        "3 tbs sugar",
        "2 tsp vanilla extract"
      ],
      "instructions": [
        "Add the vinegar to a 1-cup or larger liquid measuring cup. Pour in enough almond milk to make 1 cup total. Set aside for about 5 minutes.",
        "Meanwhile, grind the oats into a flour by adding them to the pitcher of a blender and pulsing until fine.",
        "Add the remaining ingredients to the blender. Puree, scraping down the sides once or twice if necessary, until completely combined.",
        "Let the batter rest for about 5 minutes.",
        "Heat a griddle or non-stick frying pan to about 160 degrees Celsius (medium heat). It’s hot enough when you sprinkle a couple drops of water onto the surface and the drops dance around. If the griddle/pan is nonstick, you shouldn’t need any oil/vegan butter. Otherwise, you may want to melt a little oil into the pan before cooking the pancakes.",
        "Pour approx. 1/3 cup per pancake onto the griddle or pan (the pancakes will be 4-5 inches in diameter). Cook for 1-2 minutes until the pancakes look dry around the edges and a little bubbly.",
        "Flip and cook on the other side until golden brown and cooked in the middle. If the pancakes brown before the middle is cooked through, try lowering your heat a bit.",
        "Serve with toppings of your choice."
      ],
      "image": "assets/images/banana_pancakes.jpg",
      "image_thumbnail": "assets/images/banana_pancakes_thumbnail.jpg",
      "credit": "https://www.kitchentreaty.com/gluten-free-vegan-banana-oat-blender-pancakes/",
      "created_at": "1570362534441"
    },
    {
      "name": "pizza_crust",
      "category": "lunches",
      "servings": "1",
      "prep": "10 min",
      "cooking": "10 min",
      "description": "Here is a recipe that I've been using for years now for my own homemade pizza crust from scratch! Don't be intimidated by making it at home. It's so easy and is the best crust there is!",
      "ingredients": [
        "3/4 cups warm water",
        "2 tbs granulated sugar",
        "1 tsp active dry yeast",
        "1 tsp salt",
        "1 tbsp olive oil",
        "2 cups all-purpose or plain flour",
        "additional oil for greasing"
      ],
      "instructions": [
        "In a large bowl, combine water and sugar and sprinkle yeast on top to re-hydrate. Don't use too hot of water or you will kill your yeast.",
        "After yeast is a bit foamy, add in salt, 1 Tbsp oil and flour. Mix well until it comes together to form a dough.",
        "Knead until smooth and all flour is incorporated and dough is no longer sticky, about 3 minutes.",
        "Grease a bowl with another tablespoon of oil, coat dough ball with oil and cover with a damp towel.",
        "Let rise in a warm place for 1-2 hours or until doubled in size.",
        "To use, grease a pan with more oil, pat dough out using your finger tips to 35 cm in diameter.",
        "Spread with sauce, top with cheese and toppings and bake in a preheated 230 degrees celcius oven for 12-14 minutes or until crust is golden brown and cheese is melty."
      ],
      "image": "assets/images/pizza_crust.jpg",
      "image_thumbnail": "assets/images/pizza_crust_thumbnail.jpg",
      "credit": "https://www.youtube.com/watch?v=GiSzVOTbpJQ",
      "created_at": "1570276134442"
    },
    {
      "name": "chocolate_chip_cookies",
      "category": "desserts",
      "servings": "12",
      "prep": "10 min",
      "cooking": "13 min",
      "description": "This isn't just genius for a vegan chocolate chip cookie or in spite of it. This cookie, which comes from Ovenly founders Agatha Kulaga and Erin Patinkin, can rest entirely on its own merits: its soft-bellied, chewy, caramelly-crisp-edged, rippled and ringed and puddled with melty chocolate, haunting, well-salted, incidentally vegan merits.",
      "ingredients": [
        "2 cups all-purpose flour",
        "1 tsp baking powder",
        "3/4 tsp baking soda",
        "1/2 tsp fine salt",
        "1 cups dark chocolate chips",
        "1/2 cups sugar",
        "1/2 cups dark brown sugar",
        "1/2 cups canola oil",
        "1/4 cups water"
      ],
      "instructions": [
        "In a large bowl, whisk together flour, baking powder, baking soda, and salt. Add the chocolate chips to the flour mixture and toss to coat.",
        "In a separate large bowl, whisk the sugars briskly with the canola oil and water until smooth and incorporated, about 2 minutes. Note: Use fresh, soft light brown sugar. If there are clumps, break them up with the back of a spoon or your hand before whisking.",
        "Add the flour mixture to the sugar mixture, and then stir with a wooden spoon or a rubber spatula until just combined and no flour is visible. Do not overmix.",
        "Cover with plastic wrap. Refrigerate the dough for at least 12 hours and up to 24 hours. Do not skip this step.",
        "Preheat the oven to 175 degrees Celsius. Line two rimmed sheet pans with parchment paper. Remove dough from the refrigerator and use an ice cream scoop or a spoon to portion dough into 2-inch mounds. We recommend freezing the balls of dough for 10 minutes before baking as the cookies will retain their shape better while baking.",
        "Sprinkle the balls of dough with coarse-grained sea salt (if freezing, remove balls of dough from the freezer first), and bake for 12 to 13 minutes, or until the edges are just golden. Do not overbake. "
      ],
      "image": "assets/images/chocolate_chip_cookies.jpg",
      "image_thumbnail": "assets/images/chocolate_chip_cookies_thumbnail.jpg",
      "credit": "https://food52.com/recipes/39132-ovenly-s-secretly-vegan-salted-chocolate-chip-cookies",
      "created_at": "1570189734442"
    },
    {
      "name": "cinnamon_swirl_cake",
      "category": "desserts",
      "servings": "1",
      "prep": "30 min",
      "cooking": "55 min",
      "description": "This bundt cake is drizzled with a vanilla infused sugar coat. But if you want to make it even healthier, it also tastes great with just a little bit of powdered sugar sprinkled on top! The ribbon of cinnamon sugar in the middle will give you plenty of flavor. Enjoy!",
      "ingredients": [
        "Dry ingredients:",
        "2.5 cups all-purpose flour",
        "4 tbs cornstarch",
        "1.5 tsp baking powder",
        "1 tsp baking soda",
        "1 tsp salt",
        "Wet ingredients:",
        "2 cups soy milk",
        "2 tsp apple cider vinegar",
        "2/3 cups canola oil",
        "1.5 cups granulated sugar",
        "4 tsp vanilla extract",
        "1/2 tsp almond extract",
        "Filling ingredients:",
        "1/2 cups brown sugar",
        "2 tsp cinnamon",
        "Glazing ingredients:",
        "1 cups sifted confectioners sugar",
        "2 tbs soy milk",
        "1 tsp vanilla extract"
      ],
      "instructions": [
        "Preheat the oven to 176 degrees Celsis and butter a bundt cake pan.",
        "Mix the soy milk and apple vinegar together and stir vigorously. Set aside to rest for 15 minutes.",
        "Prepare the filling by mixing the brown sugar and cinnamon together.",
        "Whisk the dry ingredients together in a large bowl, and the wet ingredients together in a smaller bowl. Combine and mix till batter is just combined.",
        "Pour ½ the batter into the pan. Add the cinnamon sugar filling mixture, poured evenly to cover the batter already in the pan. Now pour the remainder of the batter over the filling layer.",
        "Drag a spoon in a circle around the cake, with the spoon placed in the center of the batter. This makes the cinnamon sugar layer curved when the cake bakes.",
        "Bake for 55 minutes, or until a toothpick inserted in the center comes out clean."
      ],
      "image": "assets/images/cinnamon_swirl_cake.jpg",
      "image_thumbnail": "assets/images/cinnamon_swirl_cake_thumbnail.jpg",
      "credit": "https://www.savoringspoon.com/cinnamon-swirl-bundt-cake/",
      "created_at": "1570103334443"
    },
    {
      "name": "energy_bars",
      "category": "breakfasts",
      "servings": "8",
      "prep": "10 min",
      "cooking": "2 hrs",
      "description": "Healthy, no-bake granola bars with just 5 ingredients and a sweet, crunchy texture. Nuts and dates complement each other perfectly in this ideal portable breakfast or snack.",
      "ingredients": [
        "1 cups rolled oats",
        "1 cups pitted dates",
        "1/4 cups shredded coconut",
        "1/2 cups of your chosen ingredients (dried fruit, nuts, seeds)",
        "1 tbs coconut oil"
      ],
      "instructions": [      
        "Soak the dates in room temperature water for at least 10 minutes, ideally longer.",
        "Line a baking tray with some baking parchment that is twice it’s length so that half rolls off one end.",
        "Put your oats and other ingredients in a large bowl.",
        "Drain and wash the dates and put in a food processor.",
        "Blend until they have turned into a sticky paste. Persevere here – it will blend! If it needs a little help add 1/2 – 1 tbsp of melted coconut oil.",
        "Once blended add to the oat mix.",
        "Once loosely blended turn it out on to the baking tray and flatten slightly. Fold the other half of the parchment over the mixture and flatten with your hands. Use a rolling pin to flatten it out completely into a square or rectangle, using your hands to mould and straighten the edges.",
        "Put in the fridge for at least two hours to allow to set. Once set use a knife to cut into bars."
      ],
      "image": "assets/images/energy_bars.jpg",
      "image_thumbnail": "assets/images/energy_bars_thumbnail.jpg",
      "credit": "https://saretaskitchen.wordpress.com/2016/05/28/oat-and-date-energy-bars-recipe/",
      "created_at": "1570016934443"
    },
    {
      "name": "sweet_and_sour_sauce",
      "category": "sauces",
      "servings": "1",
      "prep": "10 min",
      "cooking": "10 min",
      "description": "Sweet and Sour Sauce is the classic tangy and sweet dipping sauce of Chinese takeout restaurants that has just six ingredients and takes less than 10 minutes to make!",
      "ingredients": [
        "1/2 cups ketchup",
        "1 tsp soy sauce",
        "1/3 cups white vinegar",
        "1/2 cups brown sugar",
        "3/4 cups cold water",
        "5 tbs corn starch"
      ],
      "instructions": [
        "In a saucepan, combine 1/2 cup ketchup, 1 tsp soy sauce, 1/3 cup vinegar, 1/2 cup brown sugar and 1 cup white sugar until combined.",
        "In a separate cup, whisk 3/4 cup cold water (or pineapple juice) with 4 Tbsp cornstarch until well blended.",
        "Whisk vigorously into the ketchup mixture. Bring to a boil while whisking until bubbly, then reduce heat to low and simmer until thickened, remove from heat. Keep in mind, the sauce will get thicker when cooled."
      ],
      "image": "assets/images/sweet_and_sour_sauce.jpg",
      "image_thumbnail": "assets/images/sweet_and_sour_sauce_thumbnail.jpg",
      "credit": "https://natashaskitchen.com/sweet-and-sour-sauce-recipe/",
      "created_at": "1569930534443"
    },
    {
      "name": "teriyaki_sauce",
      "category": "sauces",
      "servings": "1",
      "prep": "10 min",
      "cooking": "10 min",
      "description": "This Japanese-style teriyaki sauce recipe, similar to that which is often enjoyed at restaurants, can be easily made at home with just a few simple pantry ingredients in only 10 to 15 minutes.​​",
      "ingredients": [
        "1/2 cups soy sauce",
        "1/4 cups mirin",
        "1/4 cups sake",
        "2 tbs sugar"
      ],
      "instructions": [
        "In a small saucepan, combine soy sauce, mirin, sake and sugar.",
        "Heat over a medium-high flame while stirring the mixture well.",
        "Lower the heat to medium and bring the sauce to a boil, then turn down the heat to low.",
        "Simmer the sauce for a few minutes until the sauce reduces slightly.",
        "Remove the pan from the heat and allow the teriyaki sauce to cool."
      ],
      "image": "assets/images/teriyaki_sauce.jpg",
      "image_thumbnail": "assets/images/teriyaki_sauce_thumbnail.jpg",
      "credit": "https://www.thespruceeats.com/japanese-restaurant-style-teriyaki-sauce-recipe-2031569",
      "created_at": "1569844134444"
    },
    {
      "name": "bbq_tempeh_sandwich",
      "category": "lunches",
      "servings": "4",
      "prep": "3 min",
      "cooking": "20 min",
      "description": "This BBQ Tempeh Sandwich has it all: perfectly toasted sourdough bread, fresh lettuce and ripe tomatoes, creamy avocado, and savory sweet BBQ tempeh. Wrap the sandwich in some parchment paper and take it with you for lunch. It’s back-to-school lunchtime perfection!",
      "ingredients": [
        "1 package(s) tempeh",
        "1 cups BBQ sauce",
        "1/4 cups water",
        "8 slices of sourdough bread, toasted",
        "1/2 tomatoes, sliced",
        "4 large romaine leaves, halved",
        "1 small avocados"
      ],
      "instructions": [
        "Place the tempeh in a saucepan, and cover with the BBQ sauce and water.",
        "Make sure that the tempeh slices are covered on all sides.",
        "Cook and simmer on medium-low heat for 20-30 minutes.",
        "On toasted bread layer the sliced tomato, romaine leaves, avocado and BBQ tempeh."
      ],
      "image": "assets/images/bbq_tempeh_sandwich.jpg",
      "image_thumbnail": "assets/images/bbq_tempeh_sandwich_thumbnail.jpg",
      "credit": "http://sweetpotatosoul.com/2017/09/bbq-tempeh-sandwich.html",
      "created_at": "1569757734444"
    },
    {
      "name": "banana_bread",
      "category": "breakfasts",
      "servings": "1",
      "prep": "10 min",
      "cooking": "40 min",
      "description": "This lightened-up chocolate cake is made with just 8 ingredients and can be completely oil-free. It’s perfect as a healthy snack or dessert, is packed with whole grains and nutrition, and has a full 1/3 cup less sugar than traditional chocolate cake recipes of the same size – but you’d never guess!",
      "ingredients": [
        "2 cups white flour",
        "1/2 tsp baking soda",
        "1/2 tsp salt",
        "2/3 cups water",
        "2/3 cups white sugar",
        "1/3 cups overripe mashed banana",
        "1/4 cups nut butter/oil/additional banana",
        "2 tsp vanilla extract",
        "1/2 cups chocolate chips"
      ],
      "instructions": [
        "Line a loaf pan with parchment. Preheat oven to 170C.",
        "Combine dry ingredients, and stir very well. Evenly mix in remaining ingredients.",
        "Pour into prepared pan. Sprinkle chips on top if desired. Bake on the center rack 40 minutes. Let cool completely."
      ],
      "image": "assets/images/banana_bread.jpg",
      "image_thumbnail": "assets/images/banana_bread_thumbnail.jpg",
      "credit": "https://chocolatecoveredkatie.com/2018/09/24/chocolate-banana-cake-recipe/",
      "created_at": "1569671334444"
    },
    {
      "name": "chocolate_pb_muffins",
      "category": "desserts",
      "servings": "6",
      "prep": "5 min",
      "cooking": "20 min",
      "description": "This is one of the easiest desserts, the preparation (and baking time) is very fast, and you can make it in various flavors and diversify endlessly.",
      "ingredients": [
        "1/2 cups buckwheat, soaked overnight and drained",
        "2 tbs mashed apple",
        "1/2 cups plant-based milk",
        "1/2 tsp baking powder",
        "1/2 tsp baking soda",
        "2 tbs cocoa powder",
        "2 tbs coconut oil",
        "6 medjool dates",
        "1/8 tsp of salt",
        "2 tbs maple syrup/brown sugar",
        "Toppings:",
        "1 tbs chocolate chips",
        "3 tsp peanut butter"
      ],
      "instructions": [
        "Preheat the oven to 175C.",
        "Wash the buckwheat until the water comes out clear and drain.",
        "Place the buckwheat with the rest of the ingredients in a blender (without the toppings).",
        "Process into a smooth batter.",
        "Transfer into 6 muffin cups.",
        "Top with chocolate chips and peanut butter.",
        "Bake for 15-20 minutes until a toothpick comes out clean.",
        "Let cool completely."
      ],
      "image": "assets/images/chocolate_pb_muffins.jpg",
      "image_thumbnail": "assets/images/chocolate_pb_muffins_thumbnail.jpg",
      "credit": "https://tivoneat.co.il/flourless-vegan-muffins/",
      "created_at": "1569584934444"
    },
    {
      "name": "baked_potato_fries",
      "category": "lunches",
      "servings": "6",
      "prep": "5 min",
      "cooking": "35 min",
      "description": "Crispy, cheesy, spicy baked potato fries that are oil-free! Just 5 ingredients and simple methods required. The perfect plant-based side or snack!",
      "ingredients": [
        "3 lbs yellow potatoes (or russet potatoes)",
        "water (for steaming)",
        "3 tbs nutritional yeast",
        "1 tsp chili powder",
        "1/2 tsp garlic powder",
        "1/2 tsp sea salt"
      ],
      "instructions": [
        "Preheat oven to 218C and line two (or more as needed) baking sheets with parchment paper.",
        "Slice potatoes into small wedges about 1/4- to 1/2-inch wide. Place in a steamer basket or large colander set over a pot of boiling water. Cover and then steam approximately 5 minutes until slightly tender but not cooked.",
        "Transfer to baking sheets and top with nutritional yeast, chili powder, garlic powder, sea salt and any other desired seasonings. Toss gently to coat.",
        "Arrange in an even layer on baking sheet, trying not to overlap, so that fries can get crispy. The more room they have, the crispier they will become. Use two baking sheets if needed.",
        "Bake for 15 minutes. Then remove from oven and increase heat to 232 C. Flip to ensure even baking on both sides and bake for an additional 10-15 minutes or until crispy and golden brown.",
        "Serve hot! They're delicious as is, but they're elevated tossed in fresh herbs and garlic (optional) and served with ketchup or guacamole. Best fresh. Store leftovers covered in the refrigerator up to 4 days. Reheat in a 190C oven until hot."
      ],
      "image": "assets/images/baked_potato_fries.jpg",
      "image_thumbnail": "assets/images/baked_potato_fries_thumbnail.jpg",
      "credit": "https://minimalistbaker.com/cheesy-chili-baked-potato-fries-oil-free/",
      "created_at": "1569498534445"
    },
    {
      "name": "chocolate_cake",
      "category": "desserts",
      "servings": "1",
      "prep": "30 min",
      "cooking": "35 min",
      "description": "Prepare yourself. This one-pot chocolate cake is indeed crazy— for the BEST reasons. No Bowls. No eggs. No milk. No butter or dairy of any kind. Just simple ingredients, easy clean-up, and delicious fudgy taste. Watch to see how this delectable dessert is possible, then give it a try!",
      "ingredients": [
        "Dry ingredients:",
        "2 cups all-purpose flour",
        "5 tbs cocoa powder",
        "1 cups sugar",
        "1 tsp baking soda",
        "1/2 tsp salt",
        "Wet ingredients:",
        "1 tsp white vinegar",
        "1 tsp vanilla extract",
        "5 tbs vegetable oil",
        "1 cups water"
      ],
      "instructions": [
        "Preheat the oven to 175 degrees Celsius. Grease an 8-inch square or 9-inch round cake pan.",
        "Add all the dry ingredients directly to the pan and mix.",
        "Make 3 depressions – 2 small and 1 large – in the mixed dry ingredients.",
        "Pour the vinegar in one of the small depressions, the vanilla in the other small depression, and the vegetable oil in the large depression. Pour water over all, and mix with a fork until smooth.",
        "Bake on the middle rack of the oven for 35 minutes, until an inserted toothpick comes out clean.",
        "Allow to cool. Top with your favorite frosting and enjoy!"
      ],
      "image": "assets/images/chocolate_cake.jpg",
      "image_thumbnail": "assets/images/chocolate_cake_thumbnail.jpg",
      "credit": "https://tiphero.com/chocolate-crazy-cake",
      "created_at": "1569412134445"
    }
  ]
