[
  {
    "name": "banana_pancakes",
    "category": "breakfasts",
    "servings": "12",
    "prep": "10 min",
    "cooking": "24 min",
    "ingredients": [
      "1 tbs white vinegar",
      "3/4 cups unsweetened almond milk",
      "2 cups rolled oats",
      "1 medium ripe banana",
      "2 tsp baking powder",
      "1/2 tsp baking soda",
      "1/2 tsp ground cinnamon",
      "1/2 tsp salt",
      "3 tbs sugar",
      "2 tsp vanilla extract"
    ],
    "instructions": [
      "Add the vinegar to a 1-cup or larger liquid measuring cup. Pour in enough almond milk to make 1 cup total. Set aside for about 5 minutes.",
      "Meanwhile, grind the oats into a flour by adding them to the pitcher of a blender and pulsing until fine.",
      "Add the remaining ingredients to the blender. Puree, scraping down the sides once or twice if necessary, until completely combined.",
      "Let the batter rest for about 5 minutes.",
      "Heat a griddle or non-stick frying pan to about 160 degrees Celsius (medium heat). It’s hot enough when you sprinkle a couple drops of water onto the surface and the drops dance around. If the griddle/pan is nonstick, you shouldn’t need any oil/vegan butter. Otherwise, you may want to melt a little oil into the pan before cooking the pancakes.",
      "Pour approx. 1/3 cup per pancake onto the griddle or pan (the pancakes will be 4-5 inches in diameter). Cook for 1-2 minutes until the pancakes look dry around the edges and a little bubbly.",
      "Flip and cook on the other side until golden brown and cooked in the middle. If the pancakes brown before the middle is cooked through, try lowering your heat a bit.",
      "Serve with toppings of your choice."
    ],
    "image": "assets/images/banana_pancakes.jpg"
  },
  {
    "name": "chocolate_babka",
    "category": "desserts",
    "servings": "1",
    "prep": "30 min",
    "cooking": "45 min",
    "ingredients": [
      "Dry ingredients:",
      "3/4 cups soy milk",
      "2 tsp instant dry yeast",
      "1/4 cups coconut sugar",
      "2 cups flour",
      "1/2 tsp salt",
      "1/3 cups coconut oil, softened",
      "2 tbs vegan butter, softened",
      "Wet ingredients:",
      "1/2 cups coconut sugar",
      "1.5 tbs cacao",
      "1 tsp ground cinnamon",
      "1/4 tsp salt",
      "2 tbs coconut oil, softened",
      "2 tbs vegan butter, softened",
      "1/3 cups chocolate chips",
      "Glazing ingredients:",
      "1 tbs coconut sugar",
      "1.5 tbs water"
    ],
    "instructions": [
      "Make the dough. In a jug, warm the soy milk to 37°C-45°C, which is the perfect temperature to activate yeast in. Add the yeast and 1 teaspoon of the coconut sugar. Leave to activate for 10 minutes. You will know it's ready when the mix forms a layer of foam on the top. If it doesn't, check to see if your yeast is past its used by date or wait a little longer.",
      "In the mixing bowl of a stand mixer, add the rest of the coconut sugar, flour and salt. Using your fingertips, rub in the softened coconut oil and vegan butter. On a low speed with the dough hook attached, begin mixing the dry ingredients. Slowly add the wet ingredients. Knead for 8-10 minutes, until it bounces back when lightly touched. You can knead by hand if you don't own a stand mixer.",
      "Transfer the dough to a greased bowl, cover with a tea towel and place in a warm area to prove for 40-60 minutes or until doubled in size. Here's what I do. Preheat my oven to 40°C, turn it off and place the bowl in there with the oven door closed.",
      "Meanwhile make the filling. In a small bowl, stir all the ingredients together except for the chocolate chips. Place to one side.",
      "Assemble loaf. Line and lightly grease a bread tin. After the dough has doubled in size, place on a lightly floured surface and knead a few times to knock back the air. Roll out to an even 30x40cm rectangle. I used my ruler for this. Spread the filling over the top, leaving a 1.5cm gap all around the sides. Sprinkle over the chocolate chips.",
      "Tightly roll the dough to form a 40cm long log. Cut 1.5cm off both ends. Gently cut the log in half lengthways and have the cut sides facing up. Begin to twirl together. Pinch and twirl the bottom end together to keep the dough in place. Lift one side over the over, to form a twist. Always keeping the cut sides facing up. Carefully transfer the bread into the greased bread tin. Mine was long enough to form an 'S' in the tin, tucking the edges into the openings. During the second proving and baking, all the small gaps will be filled. Cover with with a tea towel and place in a warm area for another 60-90 minutes to double in size.",
      "Preheat the oven to 160°C fan forced. Bake babka for 40-45 minutes, until golden in appearance. Remove from oven, brush with sugar syrup and leave to cool in the tin for 10 minutes before removing and serving warm.",
      "To make sugar syrup, combine the coconut sugar and water in a small saucepan . Leave to boil over a medium high heat. Once the sugar dissolves remove from heat."
    ],
    "image": "assets/images/chocolate_babka.jpg"
  },
  {
    "name": "chocolate_cake",
    "category": "desserts",
    "servings": "1",
    "prep": "30 min",
    "cooking": "35 min",
    "ingredients": [
      "Dry ingredients:",
      "2 cups all-purpose flour",
      "5 tbs cocoa powder",
      "1 cups sugar",
      "1 tsp baking soda",
      "1/2 tsp salt",
      "Wet ingredients:",
      "1 tsp white vinegar",
      "1 tsp vanilla extract",
      "5 tbs vegetable oil",
      "1 cups water"
    ],
    "instructions": [
      "Preheat the oven to 175 degrees Celsius. Grease an 8-inch square or 9-inch round cake pan.",
      "Add all the dry ingredients directly to the pan and mix.",
      "Make 3 depressions – 2 small and 1 large – in the mixed dry ingredients.",
      "Pour the vinegar in one of the small depressions, the vanilla in the other small depression, and the vegetable oil in the large depression. Pour water over all, and mix with a fork until smooth.",
      "Bake on the middle rack of the oven for 35 minutes, until an inserted toothpick comes out clean.",
      "Allow to cool. Top with your favorite frosting and enjoy!"
    ],
    "image": "assets/images/chocolate_cake.jpg"
  },
  {
    "name": "chocolate_chip_cookies",
    "category": "desserts",
    "servings": "12",
    "prep": "10 min",
    "cooking": "13 min",
    "ingredients": [
      "2 cups all-purpose flour",
      "1 tsp baking powder",
      "3/4 tsp baking soda",
      "1/2 tsp fine salt",
      "1 cups dark chocolate chips",
      "1/2 cups sugar",
      "1/2 cups dark brown sugar",
      "1/2 cups canola oil",
      "1/4 cups water"
    ],
    "instructions": [
      "In a large bowl, whisk together flour, baking powder, baking soda, and salt. Add the chocolate chips to the flour mixture and toss to coat.",
      "In a separate large bowl, whisk the sugars briskly with the canola oil and water until smooth and incorporated, about 2 minutes. Note: Use fresh, soft light brown sugar. If there are clumps, break them up with the back of a spoon or your hand before whisking.",
      "Add the flour mixture to the sugar mixture, and then stir with a wooden spoon or a rubber spatula until just combined and no flour is visible. Do not overmix.",
      "Cover with plastic wrap. Refrigerate the dough for at least 12 hours and up to 24 hours. Do not skip this step.",
      "Preheat the oven to 175 degrees Celsius. Line two rimmed sheet pans with parchment paper. Remove dough from the refrigerator and use an ice cream scoop or a spoon to portion dough into 2-inch mounds. We recommend freezing the balls of dough for 10 minutes before baking as the cookies will retain their shape better while baking.",
      "Sprinkle the balls of dough with coarse-grained sea salt (if freezing, remove balls of dough from the freezer first), and bake for 12 to 13 minutes, or until the edges are just golden. Do not overbake. "
    ],
    "image": "assets/images/chocolate_chip_cookies.jpg"
  },
  {
    "name": "cinnamon_swirl_cake",
    "category": "desserts",
    "servings": "1",
    "prep": "30 min",
    "cooking": "55 min",
    "ingredients": [
      "Dry ingredients:",
      "2.5 cups all-purpose flour",
      "4 tbs cornstarch",
      "1.5 tsp baking powder",
      "1 tsp baking soda",
      "1 tsp salt",
      "Wet ingredients:",
      "2 cups soy milk",
      "2 tsp apple cider vinegar",
      "2/3 cups canola oil",
      "1.5 cups granulated sugar",
      "4 tsp vanilla extract",
      "1/2 tsp almond extract",
      "Filling ingredients:",
      "1/2 cups brown sugar",
      "2 tsp cinnamon",
      "Glazing ingredients:",
      "1 cups sifted confectioners sugar",
      "2 tbs soy milk",
      "1 tsp vanilla extract"
    ],
    "instructions": [
      "Preheat the oven to 176 degrees Celsis and butter a bundt cake pan.",
      "Mix the soy milk and apple vinegar together and stir vigorously. Set aside to rest for 15 minutes.",
      "Prepare the filling by mixing the brown sugar and cinnamon together.",
      "Whisk the dry ingredients together in a large bowl, and the wet ingredients together in a smaller bowl. Combine and mix till batter is just combined.",
      "Pour ½ the batter into the pan. Add the cinnamon sugar filling mixture, poured evenly to cover the batter already in the pan. Now pour the remainder of the batter over the filling layer.",
      "Drag a spoon in a circle around the cake, with the spoon placed in the center of the batter. This makes the cinnamon sugar layer curved when the cake bakes.",
      "Bake for 55 minutes, or until a toothpick inserted in the center comes out clean."
    ],
    "image": "assets/images/cinnamon_swirl_cake.jpg"
  },
  {
    "name": "energy_bars",
    "category": "breakfasts",
    "servings": "8",
    "prep": "10 min",
    "cooking": "2 hrs",
    "ingredients": [
      "1 cups rolled oats",
      "1 cups pitted dates",
      "1/4 cups shredded coconut",
      "1/2 cups of your chosen ingredients (dried fruit, nuts, seeds)",
      "1 tbs coconut oil"
    ],
    "instructions": [      
      "Soak the dates in room temperature water for at least 10 minutes, ideally longer.",
      "Line a baking tray with some baking parchment that is twice it’s length so that half rolls off one end.",
      "Put your oats and other ingredients in a large bowl.",
      "Drain and wash the dates and put in a food processor.",
      "Blend until they have turned into a sticky paste. Persevere here – it will blend! If it needs a little help add 1/2 – 1 tbsp of melted coconut oil.",
      "Once blended add to the oat mix.",
      "Once loosely blended turn it out on to the baking tray and flatten slightly. Fold the other half of the parchment over the mixture and flatten with your hands. Use a rolling pin to flatten it out completely into a square or rectangle, using your hands to mould and straighten the edges.",
      "Put in the fridge for at least two hours to allow to set. Once set use a knife to cut into bars."
    ],
    "image": "assets/images/energy_bars.jpg"
  },
  {
    "name": "sweet_and_sour_sauce",
    "category": "sauces",
    "servings": "1",
    "prep": "10 min",
    "cooking": "10 min",
    "ingredients": [
      "1/4 cups ketchup",
      "1/2 tsp soy sauce",
      "1/4 cups white vinegar",
      "1/4 cups brown sugar",
      "1/2 cups cold water",
      "1.5 tbs corn starch"
    ],
    "instructions": [
      "In a small saucepan, combine the first 5 ingredients.",
      "In a cup or bowl whisk the cold water with cornstarch until smooth and combined, then whisk in ketchup mixture.",
      "Bring to a boil stirring or whisking constantly over medium-high heat until bubbly and thickened (the sauce will continue to thicken more while simmering).",
      "Cool slightly and use immediately or refrigerate."
    ],
    "image": "assets/images/sweet_and_sour_sauce.jpg"
  },
  {
    "name": "teriyaki_sauce",
    "category": "sauces",
    "servings": "1",
    "prep": "10 min",
    "cooking": "10 min",
    "ingredients": [
      "1/2 cups soy sauce",
      "1/4 cups mirin",
      "1/4 cups sake",
      "2 tbs sugar"
    ],
    "instructions": [
      "In a small saucepan, combine soy sauce, mirin, sake and sugar.",
      "Heat over a medium-high flame while stirring the mixture well.",
      "Lower the heat to medium and bring the sauce to a boil, then turn down the heat to low.",
      "Simmer the sauce for a few minutes until the sauce reduces slightly.",
      "Remove the pan from the heat and allow the teriyaki sauce to cool."
    ],
    "image": "assets/images/teriyaki_sauce.jpg"
  },
  {
    "name": "bbq_tempeh_sandwich",
    "category": "lunches",
    "servings": "4",
    "prep": "3 min",
    "cooking": "20 min",
    "ingredients": [
      "1 package tempeh",
      "1 cup BBQ sauce",
      "1/4 cup water",
      "8 slices of sourdough bread, toasted",
      "1/2 tomato, sliced",
      "4 large romaine leaves, halved",
      "1 small avocado"
    ],
    "instructions": [
      "Place the tempeh in a saucepan, and cover with the BBQ sauce and water.",
      "Make sure that the tempeh slices are covered on all sides.",
      "Cook and simmer on medium-low heat for 20-30 minutes.",
      "On toasted bread layer the sliced tomato, romaine leaves, avocado and BBQ tempeh."
    ],
    "image": "assets/images/bbq_tempeh_sandwich.jpg"
  }
]